GT3/GT3/setup_TM/RANS-koSSTv2/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |				
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10                                  	
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 8.5e4;

boundaryField
{
    lowerWall      
    {
        type            zeroGradient;
    }

    outlet
    {
	type            fixedValue;
        value           uniform 8.5e4;
    }

    inlet
    { 
        type    zeroGradient;
    }

    lowerSymmetry      
    {
        type            zeroGradient;
    }

    upperSymmetry      
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
