GT3/GT3/setup_TM/RANS-koSSTv2/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |				
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10                                  	
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        tolerance       1e-06;
        relTol          0.01;
        smoother        GaussSeidel;
        nPreSweeps      2;
        nPostSweeps     2;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 10;
        agglomerator    faceAreaPair;
        mergeLevels     1;
    }
    
    "(U|k|omega)"
    {
/*
        solver          smoothSolver;
        smoother        GaussSeidel;
        nSweeps         2;
        tolerance       1e-08;
        relTol          0.001;
*/

        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-8;
        relTol          0;

	minIter		3;
    }

}

SIMPLE
{
    nNonOrthogonalCorrectors 2;

    consistent yes;

/*
    residualControl
    {
        p               1e-6;
        U               1e-6;
        "(k|omega|epsilon)" 	1e-6;
        "(kt|kl)" 		1e-6;
    }
*/
}

relaxationFactors
{
    equations
    {
	".*"		0.7;
    }
}

/*
relaxationFactors
{
    fields
    {
        p               0.3;
    }
    equations
    {
        p               0.3;
        U               0.7;
        k	        0.7;
        omega	        0.7;
        nut             0.7;
    }
}
*/

// ************************************************************************* //
